Autodesk.Revit.DB.EdgeArray
An array that contains edges.

Autodesk.Revit.DB.EdgeArray.Insert(Autodesk.Revit.DB.Edge,System.Int32)
System.Int32
Insert the specified edge into the array.
item: The edge to be inserted into the array.
index: The edge will be inserted before this index.
Returns: Returns whether the edge was inserted into the array.

Autodesk.Revit.DB.EdgeArray.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.EdgeArray.ReverseIterator
Autodesk.Revit.DB.EdgeArrayIterator
Retrieve a backward moving iterator to the array.
Returns: Returns a backward moving iterator to the array.

Autodesk.Revit.DB.EdgeArray.ForwardIterator
Autodesk.Revit.DB.EdgeArrayIterator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.EdgeArray.Append(Autodesk.Revit.DB.Edge)
void
Add the edge to the end of the array.
item: The edge to be added.

Autodesk.Revit.DB.EdgeArray.Clear
void
Removes every edge from the array, rendering it empty.

Autodesk.Revit.DB.EdgeArray.Size
System.Int32
get
Returns the number of edges that are in the array.

Autodesk.Revit.DB.EdgeArray.Item(System.Int32)
System.Object
Gets or sets an edge at a specified index within the array.
index: The index of the edge to be set or retrieved.
Returns: Returns the edge at the specified index.

Autodesk.Revit.DB.EdgeArray.IsEmpty
System.Boolean
get
Test to see if the array is empty.
Remarks: If the array is empty then True will be returned, otherwise False.